XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.VFxxx_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="https://raw.githubusercontent.com/Open-CMSIS-Pack/Open-CMSIS-Pack-Spec/v1.7.28/schema/PACK.xsd" schemaVersion="1.7.28">
  <vendor>Keil</vendor>
  <url>https://www.keil.com/pack/</url>
  <name>VFxxx_DFP</name>
  <description>NXP Vybrid VFxxx Family Device Support and Examples</description>
  <license>LICENSE</license>

  <requirements>
    <packages>
      <package vendor="ARM"  name="CMSIS"          version="5.0.1"/>
      <package vendor="ARM"  name="AMP"            version="1.0.0"/>
      <package vendor="Keil" name="ARM_Compiler"   version="1.3.0"/>
      <package vendor="Keil" name="MDK-Middleware" version="7.4.0"/>
    </packages>
  </requirements>

  <releases>
    <release version="1.2.1" date="2024-02-22" deprecated="2024-02-22">
      This pack is no longer maintained.
      Please contact the device vendor (NXP) for for available Software Development Kits.
      Updated Examples:
      - Terminating app_main thread with osThreadExit() to avoid endless loop
    </release>
    <release version="1.2.0" date="2018-12-12">
      Updated retarget_io_user.c for Arm Compiler 6 support.
      Updated conditions for "User I/O Redirect" component.
    </release>
    <release version="1.1.1" date="2017-10-02">
      Added Arm Compiler 6 examples.
      Updated existing projects.
    </release>
    <release version="1.1.0" date="2017-07-13">
      Added RPMSG-TTY examples for TWR-VF65GS10 and Colibri-VF61 boards.
    </release>
    <release version="1.0.0" date="2017-05-04">
      Initial release of the device family pack for Vybrid VFxxx devices.
    </release>
  </releases>

  <keywords>
  <!-- keywords for indexing -->
    <keyword>NXP</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package NXP</keyword>
    <keyword>Vybrid</keyword>
    <keyword>VFxxx</keyword>   
    <keyword>VF5xx</keyword>
    <keyword>VF6xx</keyword>
  </keywords>

  <devices>
    <family Dfamily="VFxxx" Dvendor="NXP:11">

      <subFamily DsubFamily="VF5xx">

        <!-- ******************************  VF5xx  ******************************* -->

        <processor Dcore="Cortex-A5" DcoreVersion="r0p1" Dfpu="DP_FPU" Dmpu="MPU" Pname="Cortex-A5"/>

        <debugconfig default="swd" swj="true" clock="10000000" sdf="Debug/VF5xx.sdf"/>

        <description>
          The Vybrid VF5xx family is a single-core (ARM Cortex-A5) solution.
          - ARM Cortex™-A5
          - Optional 512 KB L2 cache
          - 1.5 MB on-chip SRAM (1.0MB when L2 cache is selected)
          - Dual USB 2.0 OTG with integrated PHY
          - Dual Ethernet 10/100 MAC with L2 switch
          - Digital video camera interface
          - Dual display controllers supporting resolutions up to SVGA or one display up to XGA (1024x768)
          - High-assurance boot with crypto acceleration
          - 800 MHz DDR3 and LPDDR2 support with 8-bit ECC protection
          - NAND Flash controller and dual quad-SPI with Execute-In-Place (XIP)
          - Dual 12-bit ADC and DAC
          - Dual SDIO
        </description>
        <book name="Documents/VFXXXRM.pdf" title="VFxxx Controller Reference Manual"/>

        <debug Pname="Cortex-A5" __dp="0" __ap="1" address="0xC0088000"/>

        <device Dname="MVF50NN15xxxx40">
          <debug svd="SVD/MVF50NN151MK40.svd"/>
        </device>
        <device Dname="MVF50NN15xxxx50">
          <debug svd="SVD/MVF50NN151MK40.svd"/>
        </device>
        
        <device Dname="MVF50NS15xxxx40">
          <debug svd="SVD/MVF50NS151MK40.svd"/>
        </device>
        <device Dname="MVF50NS15xxxx50">
          <debug svd="SVD/MVF50NS151MK40.svd"/>
        </device>
        
        <device Dname="MVF51NN15xxxx50">
          <debug svd="SVD/MVF51NN151MK50.svd"/>
        </device>
        
        <device Dname="MVF51NS15xxxx50">
          <debug svd="SVD/MVF51NS151MK50.svd"/>
        </device>
        
      </subFamily>

      <subFamily DsubFamily="VF6xx">
        
        <!-- ******************************  VF6xx  ******************************* -->

        <processor Dcore="Cortex-A5" DcoreVersion="r0p1" Dfpu="DP_FPU" Dmpu="MPU" Pname="Cortex-A5"/>
        <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="SP_FPU" Dmpu="MPU" Pname="Cortex-M4"/>

        <debugconfig default="swd" swj="true" clock="10000000" sdf="Debug/VF6xx.sdf"/>
 
        <description>
          The VF6xx family is a heterogeneous dual-core solution that combines the ARM Cortex-A5 and Cortex-M4 cores.
          - Dual heterogeneous core: ARM Cortex-A5 and Cortex-M4
          - Optional 512 KB L2 Cache
          - 1.5 MB on-chip SRAM (1.0 MB when L2 Cache is selected)
          - Dual USB 2.0 OTG with integrated PHY
          - Dual Ethernet 10/100 MAC with L2 switch
          - Both digital and analog video camera interfaces
          - Dual display controllers supporting resolutions up to SVGA or one display up to XGA (1024x768)
          - High-assurance boot with crypto acceleration
          - 800 MHz DDR3 and LPDDR2 support with 8-bit ECC protection
          - NAND Flash controller and dual quad-SPI with Execute-In-Place (XIP)
          - Dual 12-bit ADC and DAC
          - Dual SDIO
        </description>
        <book name="Documents/dui0553a_cortex_m4_dgug.pdf" title="Cortex-M4 Generic User Guide"/>
        <book name="Documents/VFXXXRM.pdf" title="VFxxx Controller Reference Manual"/>

        <debug   Pname="Cortex-A5" __dp="0" __ap="1" address="0xC0088000"/>
        <debug   Pname="Cortex-M4" __dp="0" __ap="3" address="0xE000ED00"/>

        <memory  Pname="Cortex-M4" id="IROM1" start="0x1F800000" size="0x00008000" startup="1" default="1"/> <!-- CM4 TCML      -->
        <memory  Pname="Cortex-M4" id="IRAM1" start="0x3F800000" size="0x00008000" init   ="0" default="1"/> <!-- CM4 TCMU      -->
        <memory  Pname="Cortex-M4" id="IRAM2" start="0x80800000" size="0x0F800000" init   ="0" default="0"/> <!-- CM4 DDR alias -->
        
        <device Dname="MVF60NN15xxxx40">
          <compile Pname="Cortex-M4" header="Device/Include/MVF6X.h"  define="MVF60NN15xxxx40"/>
          <debug   svd="SVD/MVF60NN151MK40.svd"/>
        </device>
        <device Dname="MVF60NN15xxxx50">
          <compile Pname="Cortex-M4" header="Device/Include/MVF6X.h"  define="MVF60NN15xxxx504"/>
          <debug   svd="SVD/MVF60NN151MK40.svd"/>
        </device>
        
        <device Dname="MVF60NS15xxxx40">
          <compile Pname="Cortex-M4" header="Device/Include/MVF6X.h"  define="MVF60NS15xxxx40"/>
          <debug   svd="SVD/MVF60NS151MK40.svd"/>
        </device>        
        <device Dname="MVF60NS15xxxx50">
          <compile Pname="Cortex-M4" header="Device/Include/MVF6X.h"  define="MVF60NS15xxxx50"/>
          <debug   svd="SVD/MVF60NS151MK40.svd"/>
        </device>
        
        <device Dname="MVF61NN15xxxx50">
          <compile Pname="Cortex-M4" header="Device/Include/MVF6X.h"  define="MVF61NN15xxxx50"/>
          <debug   svd="SVD/MVF61NN151MK50.svd"/>
        </device>
        
        <device Dname="MVF61NS15xxxx50">
          <compile Pname="Cortex-M4" header="Device/Include/MVF6X.h"  define="MVF61NS15xxxx50"/>
          <debug   svd="SVD/MVF61NS151MK50.svd"/>
        </device>
        
        <device Dname="MVF62NN15xxxx40">
          <compile Pname="Cortex-M4" header="Device/Include/MVF6X.h"  define="MVF62NN15xxxx40"/>
          <debug   svd="SVD/MVF62NN151MK40.svd"/>
        </device>
        
      </subFamily>
      
    </family>
  </devices>

  <conditions>
    <!-- Device + Core + CMSIS Conditions -->
    <condition id="VF6xx M4 CMSIS">
      <description>NXP VF6xx devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept  Dname="MVF6*"/>
      <require Dcore="Cortex-M4"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="MVF60NN15">
      <accept  Dname="MVF60NN15*"/>
    </condition>
