XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.VFxxx_DFP.pdsc
    <condition id="MVF60NS15">
      <accept  Dname="MVF60NS15*"/>
    </condition>
    <condition id="MVF61NN15">
      <accept  Dname="MVF61NN15*"/>
    </condition>
    <condition id="MVF61NS15">
      <accept  Dname="MVF61NS15*"/>
    </condition>
    <condition id="MVF62NN15">
      <accept  Dname="MVF62NN15*"/>
    </condition>
    <condition id="MVF60NN15 ARMCC">
      <accept  Dname="MVF60NN15*"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="MVF60NS15 ARMCC">
      <accept  Dname="MVF60NS15*"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="MVF61NN15 ARMCC">
      <accept  Dname="MVF61NN15*"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="MVF61NS15 ARMCC">
      <accept  Dname="MVF61NS15*"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="MVF62NN15 ARMCC">
      <accept  Dname="MVF62NN15*"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="VF6xx M4 CMSIS HW">
      <description>NXP VF6xx CM4 devices, CMSIS-CORE and HW INIT</description>
      <require condition="VF6xx M4 CMSIS"/>
      <require Cclass="Board Support" Cgroup="HW INIT"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="VF6xx HAL" Csub="CCM"/>
    </condition>

    <condition id="Colibri-VF61-Aster M4 HW UART">
      <description>Colibri-VF61-Aster, M4 HW INIT and UART</description>
      <require condition="VF6xx M4 CMSIS"/>
      <require Cbundle="Colibri-VF61-Aster" Cclass="Board Support" Cgroup="HW INIT"/>
      <require Cclass="Device" Cgroup="VF6xx HAL" Csub="UART"/>
    </condition>
  </conditions>
  
  <components>
    <!-- Startup VF6xx-M4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="VF6xx M4 CMSIS">
      <description>NXP VF6xx CM4 devices</description>
      <files>
        <file category="include" name="Device/Include/"/>    
        
        <file category="source"  name="Device/Source/ARM/startup_MVF6X.s" attr="config" version="1.0.0" condition="MVF60NN15 ARMCC"/>
        <file category="source"  name="Device/Source/system_MVF6X.c"      attr="config" version="1.0.0" condition="MVF60NN15"      />
        <file category="header"  name="Device/Include/system_MVF6X.h"     attr="config" version="1.0.0" condition="MVF60NN15"      />
        
        <file category="source"  name="Device/Source/ARM/startup_MVF6X.s" attr="config" version="1.0.0" condition="MVF60NS15 ARMCC"/>
        <file category="source"  name="Device/Source/system_MVF6X.c"      attr="config" version="1.0.0" condition="MVF60NS15"      />
        <file category="header"  name="Device/Include/system_MVF6X.h"     attr="config" version="1.0.0" condition="MVF60NS15"      />
        
        <file category="source"  name="Device/Source/ARM/startup_MVF6X.s" attr="config" version="1.0.0" condition="MVF61NN15 ARMCC"/>
        <file category="source"  name="Device/Source/system_MVF6X.c"      attr="config" version="1.0.0" condition="MVF61NN15"      />
        <file category="header"  name="Device/Include/system_MVF6X.h"     attr="config" version="1.0.0" condition="MVF61NN15"      />

        <file category="source"  name="Device/Source/ARM/startup_MVF6X.s" attr="config" version="1.0.0" condition="MVF61NS15 ARMCC"/>
        <file category="source"  name="Device/Source/system_MVF6X.c"      attr="config" version="1.0.0" condition="MVF61NS15"      />
        <file category="header"  name="Device/Include/system_MVF6X.h"     attr="config" version="1.0.0" condition="MVF61NS15"      />

        <file category="source"  name="Device/Source/ARM/startup_MVF6X.s" attr="config" version="1.0.0" condition="MVF62NN15 ARMCC"/>
        <file category="source"  name="Device/Source/system_MVF6X.c"      attr="config" version="1.0.0" condition="MVF62NN15"      />
        <file category="header"  name="Device/Include/system_MVF6X.h"     attr="config" version="1.0.0" condition="MVF62NN15"      />
      </files>
    </component>

    <!-- Board Support -->
    <bundle Cbundle="TWR-VF65GS10" Cclass="Board Support" Cversion="1.0.0">
      <description>Vybrid Tower Module Board</description>
      <doc></doc>  
      <component Cgroup="HW INIT" condition="VF6xx M4 CMSIS HW">
        <description>Board specific settings for hardware initialization</description>
        <files>
          <file category="source" name="SDK/examples/vf6xx_twr_m4/board.c"/>
          <file category="header" name="SDK/examples/vf6xx_twr_m4/board.h"/>
          <file category="source" name="SDK/examples/vf6xx_twr_m4/pin_mux.c"/>
          <file category="header" name="SDK/examples/vf6xx_twr_m4/pin_mux.h"/>
        </files>
      </component>
  
      <component Cgroup="LED" Capiversion="1.00" condition="VF6xx M4 CMSIS">
        <description>LED driver</description>
        <files>
          <file category="source" name="Boards/NXP/TWR-VF65GS10/Common/LED_TWR-VF65GS10.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.00" condition="VF6xx M4 CMSIS">
        <description>Button driver</description>
        <files>
          <file category="source" name="Boards/NXP/TWR-VF65GS10/Common/Buttons_TWR-VF65GS10.c"/>
        </files>
      </component>
    </bundle>

    <bundle Cbundle="Colibri-VF61-Aster" Cclass="Board Support" Cversion="1.0.0">
      <description>Colibri-VF61 - Aster Carrier Board</description>
      <doc></doc>
      <component Cgroup="HW INIT" condition="VF6xx M4 CMSIS HW">
        <description>Board specific settings for hardware initialization</description>
        <files>
          <file category="source" name="SDK/examples/vf6xx_colibri_m4/board.c"/>
          <file category="header" name="SDK/examples/vf6xx_colibri_m4/board.h"/>
          <file category="source" name="SDK/examples/vf6xx_colibri_m4/pin_mux.c"/>
          <file category="header" name="SDK/examples/vf6xx_colibri_m4/pin_mux.h"/>
        </files>
      </component>
  
      <component Cgroup="User I/O Redirect" condition="Colibri-VF61-Aster M4 HW UART">
        <description>User I/O Redirect to UART</description>
        <files>
          <file category="header" name="Common/retarget_io_user.h"/>
          <file category="source" name="Common/retarget_io_user.c"/>
        </files>
      </component>
  
      <component Cgroup="LED" Capiversion="1.00" condition="VF6xx M4 CMSIS">
        <description>LED driver for Aster Carrier Board</description>
        <files>
          <file category="source" name="Boards/Toradex/Colibri-VF61/Common/LED_Colibri-VF61-Aster.c"/>
        </files>
      </component>
    </bundle>

