XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.VFxxx_DFP.pdsc
    <!-- VF HAL Drivers -->
    <component Cclass="Device" Cgroup="VF6xx HAL" Csub="CCM" Cversion="1.0.0" condition="VF6xx M4 CMSIS">
      <description>Clock Control Module</description>
      <files>
        <file category="source"  name="SDK/platform/drivers/src/ccm_vf6xx.c"/>
        <file category="header"  name="SDK/platform/drivers/inc/ccm_vf6xx.h"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="VF6xx HAL" Csub="SEMA4" Cversion="1.0.0" condition="VF6xx M4 CMSIS">
      <description>Resource Domain Controller</description>
      <files>
        <file category="source"  name="SDK/platform/drivers/src/sema4.c"/>
        <file category="header"  name="SDK/platform/drivers/inc/sema4.h"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="VF6xx HAL" Csub="UART" Cversion="1.0.0" condition="VF6xx M4 CMSIS">
      <description>UART Controller</description>
      <files>
        <file category="source"  name="SDK/platform/drivers/src/lpuart_vf6xx.c"/>
        <file category="header"  name="SDK/platform/drivers/inc/lpuart_vf6xx.h"/>
      </files>
    </component>

  </components>

  <boards>
    <board name="TWR-VF65GS10" vendor="NXP" revision="Rev H" orderForm="http://www.nxp.com/about/about-nxp/technology-leadership/process-technology/thin-film-storage-tfs-with-flexmemory-technology/vybrid-controller-solutions-tower-system-module:TWR-VF65GS10?tab=Buy_Parametric_Tab">
      <description>Vybrid Tower Module Board</description>
      <mountedDevice deviceIndex="0" Dvendor="NXP:11" Dname="MVF61NS15xxxx50"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" Dname="MVF6*"/>
      <image small="Images/TWR-VF65GS10_small.jpg" large="Images/TWR-VF65GS10_large.jpg"/>
      <book category="overview"  name="http://www.nxp.com/about/about-nxp/technology-leadership/process-technology/thin-film-storage-tfs-with-flexmemory-technology/vybrid-controller-solutions-tower-system-module:TWR-VF65GS10" title="Overview Page"/>
      <book category="manual"    name="Documents/TWRVF65GS10UG.pdf"    title="User Manual"/>
      <book category="other"     name="Documents/TWRVF65GS10QSG.pdf"   title="Getting Started Guide"/>
      <book category="schematic" name="Documents/TWR-VF65GS10_SCH.pdf" title="Schematics"/>
      <feature type="RAM"           n="1" name="1.5MB SRAM"/>
      <feature type="RAM"           n="1" name="1Gbit x 16bit DDR3"/>
      <feature type="ROM"           n="1" name="2Gbit x 16bit NAND flash"/>
      <feature type="ROM"           n="2" name="128Mbit Quad SPI flash"/>
      <feature type="LED"           n="4" name="User LEDs"/>
      <feature type="Button"        n="4" name="Push-buttons for user input and reset"/>
      <feature type="MemCard"       n="1" name="Micro SD card slot"/>
      <feature type="USB"           n="1" name="USB Host connector"/>
      <feature type="USB"           n="1" name="USB-OTG Micro-AB connector"/>
      <feature type="Accelerometer" n="1" name="3-axis digital accelerometer"/>
      <feature type="Poti"          n="1" name="Analog Voltage Control for ADC Input (potentiometer)"/>
      <feature type="ConnOther"     n="1" name="Interfaces to TWR-LCD-RGB graphical LCD module"/>
      <debugInterface adapter="JTAG/SW" connector="20-pin Cortex debug + ETM Trace (0.05 inch connector)"/>
    </board>

    <board name="Colibri-VF61" vendor="Toradex" orderForm="https://www.toradex.com/computer-on-modules/colibri-arm-family/nxp-freescale-vybrid-vf6xx#buy_now">
      <description>Colibri-VF61 Board</description>
      <mountedDevice deviceIndex="0" Dvendor="NXP:11" Dname="MVF61NN15xxxx50"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" Dname="MVF6*"/>
      <image small="Images/Colibri-VF61_small.jpg" large="Images/Colibri-VF61_large.jpg"/>
      <book category="overview"  name="http://developer.toradex.com/products/colibri-vf61" title="Overview Page"/>
      <book category="manual"    name="Documents/colibri_arm_som_vfxx_datasheet.pdf"       title="Datasheet"/>
      <feature type="RAM"        n="1"                name="1.0MB (512KB with ECC) On-chip SRAM"/>
      <feature type="RAM"        n="1"                name="DDR3 256MB (16 bit mode, no ECC) or 128MB (8 bit, ECC enabled)"/>
      <feature type="ROM"        n="1"                name="512MB NAND flash"/>
      <feature type="MemCard"    n="1"                name="Micro SD card slot"/>
      <feature type="ETH"        n="1" m="1000000000" name="RJ45"/>
      <feature type="USB"        n="2"                name="USB Host connector"/>
      <feature type="USB"        n="1"                name="USB-OTG Micro-AB connector"/>
      <feature type="CAN"        n="2"/>
      <feature type="I2C"        n="4"/>
      <feature type="SPI"        n="4"/>
      <debugInterface adapter="JTAG/SW" connector="Colibri Carrier Board: 20-pin Cortex debug + ETM Trace (0.05 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="Aster Carrier Board: 10-pin Cortex debug (0.05 inch connector)"/>
    </board>

    <board name="Colibri-VF50" vendor="Toradex" orderForm="https://www.toradex.com/computer-on-modules/colibri-arm-family/nxp-freescale-vybrid-vf5xx#buy_now">
      <description>Colibri-VF50 Board</description>
      <mountedDevice deviceIndex="0" Dvendor="NXP:11" Dname="MVF50NN15xxxx40"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" Dname="MVF5*"/>
      <image small="Images/Colibri-VF50_small.jpg" large="Images/Colibri-VF50_large.jpg"/>
      <book category="overview"  name="http://developer.toradex.com/products/colibri-vf50" title="Overview Page"/>
      <book category="manual"    name="Documents/colibri_arm_som_vfxx_datasheet.pdf"       title="Datasheet"/>
      <feature type="RAM"        n="1"                name="1.5MB (512KB with ECC) On-chip SRAM"/>
      <feature type="RAM"        n="1"                name="DDR3 128MB (16 bit mode, no ECC) or 64MB (8 bit, ECC enabled)"/>
      <feature type="ROM"        n="1"                name="128MB NAND flash"/>
      <feature type="MemCard"    n="1"                name="Micro SD card slot"/>
      <feature type="ETH"        n="1" m="1000000000" name="RJ45"/>
      <feature type="USB"        n="2"                name="USB Host connector"/>
      <feature type="USB"        n="1"                name="USB-OTG Micro-AB connector"/>
      <feature type="CAN"        n="2"/>
      <feature type="I2C"        n="4"/>
      <feature type="SPI"        n="4"/>
      <debugInterface adapter="JTAG/SW" connector="Colibri Carrier Board: 20-pin Cortex debug + ETM Trace (0.05 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="Aster Carrier Board: 10-pin Cortex debug (0.05 inch connector)"/>
    </board>
  </boards>

  <examples>
    <example name="CMSIS-RTOS Blinky M4" doc="Abstract.txt" folder="Boards/NXP/TWR-VF65GS10/Blinky_M4">
      <description>CMSIS-RTOS based Blinky example for Cortex-M4</description>
      <board name="TWR-VF65GS10" vendor="NXP"/>
      <project>
        <environment name="ds5" load="DS-MDK/.project"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <example name="CMSIS-RTOS2 Blinky M4 AC6" doc="Abstract.txt" folder="Boards/NXP/TWR-VF65GS10/Blinky_M4_RTX5_AC6">
      <description>CMSIS-RTOS2 RTX5 Blinky example for Cortex-M4 and ARMCC6</description>
      <board name="TWR-VF65GS10" vendor="NXP"/>
      <project>
        <environment name="ds5" load="DS-MDK/.project"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS2"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX5</category>
      </attributes>
    </example>

    <example name="RPMSG TTY CMSIS-RTOS" doc="Abstract.txt" folder="Boards/NXP/TWR-VF65GS10/RPMSG_TTY_CMSIS-RTOS_M4">
      <description>CMSIS-RTOS RTX TTY example for Cortex-M4</description>
      <board name="TWR-VF65GS10" vendor="NXP"/>
      <project>
        <environment name="ds5" load="DS-MDK/.project"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <component Cclass="AMP" Cgroup="RPMSG" Cvariant="OpenAMP"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <example name="RPMSG TTY CMSIS-RTOS2" doc="Abstract.txt" folder="Boards/NXP/TWR-VF65GS10/RPMSG_TTY_CMSIS-RTOS2_M4">
      <description>CMSIS-RTOS2 RTX5 TTY example for Cortex-M4</description>
      <board name="TWR-VF65GS10" vendor="NXP"/>
      <project>
        <environment name="ds5" load="DS-MDK/.project"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS2"/>
        <component Cclass="AMP" Cgroup="RPMSG" Cvariant="OpenAMP"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX5</category>
      </attributes>
    </example>

